# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import numpy as np 
import pandas as pd

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [7]:
s1 = pd.Series(np.random.randint(1, high=5, size=100, dtype='l'))
s2 = pd.Series(np.random.randint(1, high=4, size=100, dtype='l'))
s3 = pd.Series(np.random.randint(10000, high=30001, size=100, dtype='l'))
print(s1, s2, s3)

0     3
1     1
2     3
3     1
4     4
     ..
95    2
96    4
97    3
98    4
99    4
Length: 100, dtype: int32 0     2
1     1
2     2
3     1
4     3
     ..
95    2
96    3
97    3
98    1
99    1
Length: 100, dtype: int32 0     26377
1     21867
2     10746
3     24977
4     20084
      ...
95    26936
96    29590
97    22800
98    28405
99    29081
Length: 100, dtype: int32

### Step 3. Let's create a DataFrame by joinning the Series by column

In [8]:
df = pd.concat([s1, s2, s3], axis=1)
df.head()

   0  1      2
0  3  2  26377
1  1  1  21867
2  3  2  10746
3  1  1  24977
4  4  3  20084

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [9]:
df.rename(columns = {0: 'bedrs', 1: 'bathrs', 2: 'price_sqr_meter'}, inplace=True)
df.head()

   bedrs  bathrs  price_sqr_meter
0      3       2            26377
1      1       1            21867
2      3       2            10746
3      1       1            24977
4      4       3            20084

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [10]:
bigcolumn = pd.concat([s1, s2, s3], axis=0)
bigcolumn = bigcolumn.to_frame()
bigcolumn

        0
0       3
1       1
2       3
3       1
4       4
..    ...
95  26936
96  29590
97  22800
98  28405
99  29081

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [11]:
len(bigcolumn)

300

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [12]:
bigcolumn.reset_index( inplace=True)
bigcolumn

     index      0
0        0      3
1        1      1
2        2      3
3        3      1
4        4      4
..     ...    ...
295     95  26936
296     96  29590
297     97  22800
298     98  28405
299     99  29081

[300 rows x 2 columns]